---
kind: type
id: T:Autodesk.Revit.DB.Architecture.StairsPathDirection
source: html/e998027f-18a6-d878-0e34-c589ab74d586.htm
---
# Autodesk.Revit.DB.Architecture.StairsPathDirection

The direction style of stairs path.

## Syntax (C#)
```csharp
public enum StairsPathDirection
```